docs/module-a/load-test-1-baseline/spike-test/terminal-output.txt
baonq@bao:~/projects/uit-go-backend$ make test-load
docker run --rm -i \
        -v /home/baonq/projects/uit-go-backend/tests/k6:/scripts \
        --network host \
        grafana/k6 run --out influxdb=http://localhost:8086/k6 /scripts/spike-test.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/spike-test.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  00.8s/50.0s

running (0m02.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 002/100 VUs  01.8s/50.0s

running (0m03.0s), 003/100 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 003/100 VUs  02.8s/50.0s

running (0m04.0s), 004/100 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 004/100 VUs  03.8s/50.0s

running (0m05.0s), 005/100 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 005/100 VUs  04.8s/50.0s

running (0m06.0s), 006/100 VUs, 14 complete and 0 interrupted iterations
default   [  12% ] 006/100 VUs  05.8s/50.0s

running (0m07.0s), 007/100 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 007/100 VUs  06.8s/50.0s

running (0m08.0s), 008/100 VUs, 27 complete and 0 interrupted iterations
default   [  16% ] 008/100 VUs  07.8s/50.0s

running (0m09.0s), 008/100 VUs, 35 complete and 0 interrupted iterations
default   [  18% ] 008/100 VUs  08.8s/50.0s

running (0m10.0s), 009/100 VUs, 42 complete and 0 interrupted iterations
default   [  20% ] 009/100 VUs  09.8s/50.0s

running (0m11.0s), 012/100 VUs, 51 complete and 0 interrupted iterations
default   [  22% ] 012/100 VUs  10.8s/50.0s

running (0m12.0s), 015/100 VUs, 62 complete and 0 interrupted iterations
default   [  24% ] 015/100 VUs  11.8s/50.0s

running (0m13.0s), 018/100 VUs, 77 complete and 0 interrupted iterations
default   [  26% ] 018/100 VUs  12.8s/50.0s

running (0m14.0s), 021/100 VUs, 95 complete and 0 interrupted iterations
default   [  28% ] 021/100 VUs  13.8s/50.0s

running (0m15.0s), 024/100 VUs, 115 complete and 0 interrupted iterations
default   [  30% ] 024/100 VUs  14.8s/50.0s

running (0m16.0s), 027/100 VUs, 138 complete and 0 interrupted iterations
default   [  32% ] 027/100 VUs  15.8s/50.0s

running (0m17.0s), 030/100 VUs, 164 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  16.8s/50.0s

running (0m18.0s), 033/100 VUs, 192 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  17.8s/50.0s

running (0m19.0s), 036/100 VUs, 221 complete and 0 interrupted iterations
default   [  38% ] 036/100 VUs  18.8s/50.0s

running (0m20.0s), 039/100 VUs, 255 complete and 0 interrupted iterations
default   [  40% ] 039/100 VUs  19.8s/50.0s

running (0m21.0s), 042/100 VUs, 287 complete and 0 interrupted iterations
default   [  42% ] 042/100 VUs  20.8s/50.0s

running (0m22.0s), 045/100 VUs, 316 complete and 0 interrupted iterations
default   [  44% ] 045/100 VUs  21.8s/50.0s

running (0m23.0s), 048/100 VUs, 355 complete and 0 interrupted iterations
default   [  46% ] 048/100 VUs  22.8s/50.0s

running (0m24.0s), 051/100 VUs, 391 complete and 0 interrupted iterations
default   [  48% ] 051/100 VUs  23.8s/50.0s

running (0m25.0s), 054/100 VUs, 426 complete and 0 interrupted iterations
default   [  50% ] 054/100 VUs  24.8s/50.0s

running (0m26.0s), 057/100 VUs, 478 complete and 0 interrupted iterations
default   [  52% ] 057/100 VUs  25.8s/50.0s

running (0m27.0s), 060/100 VUs, 527 complete and 0 interrupted iterations
default   [  54% ] 060/100 VUs  26.8s/50.0s

running (0m28.0s), 063/100 VUs, 584 complete and 0 interrupted iterations
default   [  56% ] 063/100 VUs  27.8s/50.0s

running (0m30.5s), 066/100 VUs, 640 complete and 0 interrupted iterations
default   [  58% ] 066/100 VUs  28.8s/50.0s

running (0m31.5s), 069/100 VUs, 685 complete and 0 interrupted iterations
default   [  60% ] 069/100 VUs  29.8s/50.0s

running (0m32.5s), 072/100 VUs, 718 complete and 0 interrupted iterations
default   [  62% ] 072/100 VUs  30.8s/50.0s

running (0m33.5s), 075/100 VUs, 767 complete and 0 interrupted iterations
default   [  64% ] 075/100 VUs  31.8s/50.0s

running (0m34.5s), 078/100 VUs, 808 complete and 0 interrupted iterations
default   [  66% ] 078/100 VUs  32.8s/50.0s

running (0m35.5s), 081/100 VUs, 855 complete and 0 interrupted iterations
default   [  68% ] 081/100 VUs  33.8s/50.0s

running (0m36.5s), 084/100 VUs, 897 complete and 0 interrupted iterations
default   [  70% ] 084/100 VUs  34.8s/50.0s

running (0m37.5s), 087/100 VUs, 950 complete and 0 interrupted iterations
default   [  72% ] 087/100 VUs  35.8s/50.0s

running (0m38.5s), 090/100 VUs, 999 complete and 0 interrupted iterations
default   [  74% ] 090/100 VUs  36.8s/50.0s

running (0m39.5s), 093/100 VUs, 1047 complete and 0 interrupted iterations
default   [  76% ] 093/100 VUs  37.8s/50.0s

running (0m40.5s), 096/100 VUs, 1090 complete and 0 interrupted iterations
default   [  78% ] 096/100 VUs  38.8s/50.0s

running (0m41.5s), 099/100 VUs, 1113 complete and 0 interrupted iterations
default   [  80% ] 099/100 VUs  39.8s/50.0s

running (0m42.5s), 099/100 VUs, 1135 complete and 0 interrupted iterations
default   [  82% ] 099/100 VUs  40.8s/50.0s

running (0m43.5s), 095/100 VUs, 1176 complete and 0 interrupted iterations
default   [  84% ] 095/100 VUs  41.8s/50.0s

running (0m44.5s), 082/100 VUs, 1232 complete and 0 interrupted iterations
default   [  86% ] 082/100 VUs  42.8s/50.0s

running (0m45.5s), 069/100 VUs, 1292 complete and 0 interrupted iterations
default   [  88% ] 069/100 VUs  43.8s/50.0s

running (0m46.5s), 059/100 VUs, 1353 complete and 0 interrupted iterations
default   [  90% ] 059/100 VUs  44.8s/50.0s

running (0m47.5s), 049/100 VUs, 1402 complete and 0 interrupted iterations
default   [  92% ] 049/100 VUs  45.8s/50.0s

running (0m48.5s), 038/100 VUs, 1440 complete and 0 interrupted iterations
default   [  94% ] 038/100 VUs  46.8s/50.0s

running (0m49.5s), 028/100 VUs, 1478 complete and 0 interrupted iterations
default   [  96% ] 028/100 VUs  47.8s/50.0s

running (0m50.5s), 018/100 VUs, 1503 complete and 0 interrupted iterations
default   [  98% ] 018/100 VUs  48.8s/50.0s

running (0m51.5s), 009/100 VUs, 1521 complete and 0 interrupted iterations
default   [ 100% ] 009/100 VUs  49.8s/50.0s

running (0m52.5s), 001/100 VUs, 1530 complete and 0 interrupted iterations
default ↓ [ 100% ] 008/100 VUs  50s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=1.94s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3064    58.289279/s
    checks_succeeded...: 100.00% 3064 out of 3064
    checks_failed......: 0.00%   0 out of 3064

    ✓ login successful
    ✓ has token
    ✓ booking status is 200 or 201
    ✓ response has tripId

    HTTP
    http_req_duration..............: avg=483.62ms min=19.74ms med=292.31ms max=3.6s p(90)=996.36ms p(95)=1.94s
      { expected_response:true }...: avg=483.62ms min=19.74ms med=292.31ms max=3.6s p(90)=996.36ms p(95)=1.94s
    http_req_failed................: 0.00%  0 out of 1532
    http_reqs......................: 1532   29.14464/s

    EXECUTION
    iteration_duration.............: avg=1.47s    min=1.02s   med=1.27s    max=4.6s p(90)=1.92s    p(95)=2.94s
    iterations.....................: 1531   29.125616/s
    vus............................: 1      min=1         max=99 
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 824 kB 16 kB/s
    data_sent......................: 924 kB 18 kB/s



running (0m52.6s), 000/100 VUs, 1531 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  50s
time="2025-11-28T13:55:04Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"
make: *** [Makefile:27: test-load] Error 99